[Survived] StringLiteral
src/lib/server/security.ts:10:49
 	const response = await resolve(event);
 
 	// Security headers
-	response.headers.set('X-Content-Type-Options', 'nosniff');
+	response.headers.set('X-Content-Type-Options', "");
 	response.headers.set('X-Frame-Options', 'DENY');
 	response.headers.set('X-XSS-Protection', '1; mode=block');

[Survived] StringLiteral
src/lib/server/security.ts:10:23
 	const response = await resolve(event);
 
 	// Security headers
-	response.headers.set('X-Content-Type-Options', 'nosniff');
+	response.headers.set("", 'nosniff');
 	response.headers.set('X-Frame-Options', 'DENY');
 	response.headers.set('X-XSS-Protection', '1; mode=block');

[Survived] StringLiteral
src/lib/server/security.ts:21:3
 
 	// Content Security Policy
 	response.headers.set(
-		'Content-Security-Policy',
+		"",
 		[
 			"default-src 'self'",

[Survived] StringLiteral
src/lib/server/security.ts:24:4
 		'Content-Security-Policy',
 		[
 			"default-src 'self'",
-			"script-src 'self' 'unsafe-inline'", // unsafe-inline needed for Svelte
+			"", // unsafe-inline needed for Svelte
 			"style-src 'self' 'unsafe-inline'", // unsafe-inline needed for Svelte
 			"img-src 'self' data: blob:",

[Survived] StringLiteral
src/lib/server/security.ts:28:4
 			"style-src 'self' 'unsafe-inline'", // unsafe-inline needed for Svelte
 			"img-src 'self' data: blob:",
 			"font-src 'self' data:",
-			"connect-src 'self'",
+			"",
 			"frame-ancestors 'none'",
 			"base-uri 'self'",

[Survived] StringLiteral
src/lib/server/security.ts:31:4
 			"connect-src 'self'",
 			"frame-ancestors 'none'",
 			"base-uri 'self'",
-			"form-action 'self'"
+			""
 		].join('; ')
 	);

[Survived] EqualityOperator
src/lib/server/security.ts:36:6
 	);
 
 	// HSTS (HTTP Strict Transport Security) - only in production with HTTPS
-	if (event.url.protocol === 'https:') {
+	if (event.url.protocol !== 'https:') {
 		response.headers.set('Strict-Transport-Security', 'max-age=31536000; includeSubDomains');
 	}

[Survived] ConditionalExpression
src/lib/server/security.ts:36:6
 	);
 
 	// HSTS (HTTP Strict Transport Security) - only in production with HTTPS
-	if (event.url.protocol === 'https:') {
+	if (true) {
 		response.headers.set('Strict-Transport-Security', 'max-age=31536000; includeSubDomains');
 	}

[Survived] StringLiteral
src/lib/server/security.ts:37:53
 
 	// HSTS (HTTP Strict Transport Security) - only in production with HTTPS
 	if (event.url.protocol === 'https:') {
-		response.headers.set('Strict-Transport-Security', 'max-age=31536000; includeSubDomains');
+		response.headers.set('Strict-Transport-Security', "");
 	}
 

[Survived] BlockStatement
src/lib/server/security.ts:46:68
 /**
  * Enforce HTTPS in production
  */
-export const httpsRedirect: Handle = async ({ event, resolve }) => {
-	const proto = event.request.headers.get('x-forwarded-proto');
-
-	// In production, redirect HTTP to HTTPS
-	if (process.env.NODE_ENV === 'production' && proto === 'http') {
-		const httpsUrl = event.url.toString().replace('http://', 'https://');
-		return new Response(null, {
-			status: 301,
-			headers: {
-				location: httpsUrl
-			}
-		});
-	}
-
-	return resolve(event);
-};
+export const httpsRedirect: Handle = async ({ event, resolve }) => {};
 
 /**

[Survived] EqualityOperator
src/lib/server/security.ts:50:6
 	const proto = event.request.headers.get('x-forwarded-proto');
 
 	// In production, redirect HTTP to HTTPS
-	if (process.env.NODE_ENV === 'production' && proto === 'http') {
+	if (process.env.NODE_ENV !== 'production' && proto === 'http') {
 		const httpsUrl = event.url.toString().replace('http://', 'https://');
 		return new Response(null, {

[Survived] LogicalOperator
src/lib/server/security.ts:50:6
 	const proto = event.request.headers.get('x-forwarded-proto');
 
 	// In production, redirect HTTP to HTTPS
-	if (process.env.NODE_ENV === 'production' && proto === 'http') {
+	if (process.env.NODE_ENV === 'production' || proto === 'http') {
 		const httpsUrl = event.url.toString().replace('http://', 'https://');
 		return new Response(null, {

[Killed] BlockStatement
src/lib/server/security.ts:66:54
 /**
  * Sanitize user input to prevent XSS
  */
-export function sanitizeInput(input: string): string {
-	let sanitized = input;
-
-	// Remove dangerous characters - loop to handle nested attempts
-	while (sanitized !== (sanitized = sanitized.replace(/[<>]/g, '')));
-
-	// Remove javascript: protocol - loop to handle obfuscation like jajavascript:vascript:
-	while (sanitized !== (sanitized = sanitized.replace(/javascript:/gi, '')));
-
-	// Remove all URL schemes that could be dangerous
-	sanitized = sanitized.replace(/\b(javascript|data|vbscript|about):/gi, '');
-
-	// Remove event handlers - more comprehensive
-	sanitized = sanitized.replace(/\s*on\w+\s*=/gi, '');
-
-	return sanitized.trim();
-}
+export function sanitizeInput(input: string): string {}
 
 /**
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run



 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] ConditionalExpression
src/lib/server/security.ts:70:9
 	let sanitized = input;
 
 	// Remove dangerous characters - loop to handle nested attempts
-	while (sanitized !== (sanitized = sanitized.replace(/[<>]/g, '')));
+	while (false);
 
 	// Remove javascript: protocol - loop to handle obfuscation like jajavascript:vascript:
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Timeout] EqualityOperator
src/lib/server/security.ts:70:9
 	let sanitized = input;
 
 	// Remove dangerous characters - loop to handle nested attempts
-	while (sanitized !== (sanitized = sanitized.replace(/[<>]/g, '')));
+	while (sanitized === (sanitized = sanitized.replace(/[<>]/g, '')));
 
 	// Remove javascript: protocol - loop to handle obfuscation like jajavascript:vascript:

[Killed] ConditionalExpression
src/lib/server/security.ts:73:9
 	while (sanitized !== (sanitized = sanitized.replace(/[<>]/g, '')));
 
 	// Remove javascript: protocol - loop to handle obfuscation like jajavascript:vascript:
-	while (sanitized !== (sanitized = sanitized.replace(/javascript:/gi, '')));
+	while (false);
 
 	// Remove all URL schemes that could be dangerous
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Timeout] EqualityOperator
src/lib/server/security.ts:73:9
 	while (sanitized !== (sanitized = sanitized.replace(/[<>]/g, '')));
 
 	// Remove javascript: protocol - loop to handle obfuscation like jajavascript:vascript:
-	while (sanitized !== (sanitized = sanitized.replace(/javascript:/gi, '')));
+	while (sanitized === (sanitized = sanitized.replace(/javascript:/gi, '')));
 
 	// Remove all URL schemes that could be dangerous

[Survived] StringLiteral
src/lib/server/security.ts:76:73
 	while (sanitized !== (sanitized = sanitized.replace(/javascript:/gi, '')));
 
 	// Remove all URL schemes that could be dangerous
-	sanitized = sanitized.replace(/\b(javascript|data|vbscript|about):/gi, '');
+	sanitized = sanitized.replace(/\b(javascript|data|vbscript|about):/gi, "Stryker was here!");
 
 	// Remove event handlers - more comprehensive

[Killed] StringLiteral
src/lib/server/security.ts:79:50
 	sanitized = sanitized.replace(/\b(javascript|data|vbscript|about):/gi, '');
 
 	// Remove event handlers - more comprehensive
-	sanitized = sanitized.replace(/\s*on\w+\s*=/gi, '');
+	sanitized = sanitized.replace(/\s*on\w+\s*=/gi, "Stryker was here!");
 
 	return sanitized.trim();
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Survived] Regex
src/lib/server/security.ts:79:32
 	sanitized = sanitized.replace(/\b(javascript|data|vbscript|about):/gi, '');
 
 	// Remove event handlers - more comprehensive
-	sanitized = sanitized.replace(/\s*on\w+\s*=/gi, '');
+	sanitized = sanitized.replace(/\s*on\w+\S*=/gi, '');
 
 	return sanitized.trim();

[Killed] MethodExpression
src/lib/server/security.ts:81:9
 	// Remove event handlers - more comprehensive
 	sanitized = sanitized.replace(/\s*on\w+\s*=/gi, '');
 
-	return sanitized.trim();
+	return sanitized;
 }
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] BlockStatement
src/lib/server/security.ts:87:60
 /**
  * Validate filename for security
  */
-export function sanitizeFilename(filename: string): string {
-	// Remove path traversal attempts
-	let sanitized = filename.replace(/\.\./g, '');
-
-	// Remove potentially dangerous characters
-	sanitized = sanitized.replace(/[/\\]/g, '_');
-
-	// Limit length
-	if (sanitized.length > 255) {
-		const ext = sanitized.split('.').pop() || '';
-		const nameWithoutExt = sanitized.substring(0, 255 - ext.length - 1);
-		sanitized = `${nameWithoutExt}.${ext}`;
-	}
-
-	return sanitized || 'unnamed_file';
-}
+export function sanitizeFilename(filename: string): string {}
 
 /**
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run



 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] BlockStatement
src/lib/server/security.ts:95:30
 	sanitized = sanitized.replace(/[/\\]/g, '_');
 
 	// Limit length
-	if (sanitized.length > 255) {
-		const ext = sanitized.split('.').pop() || '';
-		const nameWithoutExt = sanitized.substring(0, 255 - ext.length - 1);
-		sanitized = `${nameWithoutExt}.${ext}`;
-	}
+	if (sanitized.length > 255) {}
 
 	return sanitized || 'unnamed_file';
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] ConditionalExpression
src/lib/server/security.ts:95:6
 	sanitized = sanitized.replace(/[/\\]/g, '_');
 
 	// Limit length
-	if (sanitized.length > 255) {
+	if (false) {
 		const ext = sanitized.split('.').pop() || '';
 		const nameWithoutExt = sanitized.substring(0, 255 - ext.length - 1);
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] LogicalOperator
src/lib/server/security.ts:96:15
 
 	// Limit length
 	if (sanitized.length > 255) {
-		const ext = sanitized.split('.').pop() || '';
+		const ext = sanitized.split('.').pop() && '';
 		const nameWithoutExt = sanitized.substring(0, 255 - ext.length - 1);
 		sanitized = `${nameWithoutExt}.${ext}`;
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] ConditionalExpression
src/lib/server/security.ts:96:15
 
 	// Limit length
 	if (sanitized.length > 255) {
-		const ext = sanitized.split('.').pop() || '';
+		const ext = false;
 		const nameWithoutExt = sanitized.substring(0, 255 - ext.length - 1);
 		sanitized = `${nameWithoutExt}.${ext}`;
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] MethodExpression
src/lib/server/security.ts:97:26
 	// Limit length
 	if (sanitized.length > 255) {
 		const ext = sanitized.split('.').pop() || '';
-		const nameWithoutExt = sanitized.substring(0, 255 - ext.length - 1);
+		const nameWithoutExt = sanitized;
 		sanitized = `${nameWithoutExt}.${ext}`;
 	}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] ArithmeticOperator
src/lib/server/security.ts:97:49
 	// Limit length
 	if (sanitized.length > 255) {
 		const ext = sanitized.split('.').pop() || '';
-		const nameWithoutExt = sanitized.substring(0, 255 - ext.length - 1);
+		const nameWithoutExt = sanitized.substring(0, 255 - ext.length + 1);
 		sanitized = `${nameWithoutExt}.${ext}`;
 	}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] StringLiteral
src/lib/server/security.ts:98:15
 	if (sanitized.length > 255) {
 		const ext = sanitized.split('.').pop() || '';
 		const nameWithoutExt = sanitized.substring(0, 255 - ext.length - 1);
-		sanitized = `${nameWithoutExt}.${ext}`;
+		sanitized = ``;
 	}
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] LogicalOperator
src/lib/server/security.ts:101:9
 		sanitized = `${nameWithoutExt}.${ext}`;
 	}
 
-	return sanitized || 'unnamed_file';
+	return sanitized && 'unnamed_file';
 }
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] ConditionalExpression
src/lib/server/security.ts:101:9
 		sanitized = `${nameWithoutExt}.${ext}`;
 	}
 
-	return sanitized || 'unnamed_file';
+	return false;
 }
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] BlockStatement
src/lib/server/security.ts:107:84
 /**
  * Validate MIME type against whitelist
  */
-export function isValidMimeType(mimeType: string, allowedTypes: string[]): boolean {
-	// If no restrictions, allow all
-	if (allowedTypes.length === 0) return true;
-
-	// Exact match
-	if (allowedTypes.includes(mimeType)) return true;
-
-	// Wildcard match (e.g., image/*)
-	const category = mimeType.split('/')[0];
-	if (allowedTypes.includes(`${category}/*`)) return true;
-
-	return false;
-}
+export function isValidMimeType(mimeType: string, allowedTypes: string[]): boolean {}
 
 /**
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] BooleanLiteral
src/lib/server/security.ts:109:40
  */
 export function isValidMimeType(mimeType: string, allowedTypes: string[]): boolean {
 	// If no restrictions, allow all
-	if (allowedTypes.length === 0) return true;
+	if (allowedTypes.length === 0) return false;
 
 	// Exact match
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] ConditionalExpression
src/lib/server/security.ts:109:6
  */
 export function isValidMimeType(mimeType: string, allowedTypes: string[]): boolean {
 	// If no restrictions, allow all
-	if (allowedTypes.length === 0) return true;
+	if (true) return true;
 
 	// Exact match
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run



 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] ConditionalExpression
src/lib/server/security.ts:112:6
 	if (allowedTypes.length === 0) return true;
 
 	// Exact match
-	if (allowedTypes.includes(mimeType)) return true;
+	if (false) return true;
 
 	// Wildcard match (e.g., image/*)
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] BooleanLiteral
src/lib/server/security.ts:112:46
 	if (allowedTypes.length === 0) return true;
 
 	// Exact match
-	if (allowedTypes.includes(mimeType)) return true;
+	if (allowedTypes.includes(mimeType)) return false;
 
 	// Wildcard match (e.g., image/*)
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] ConditionalExpression
src/lib/server/security.ts:116:6
 
 	// Wildcard match (e.g., image/*)
 	const category = mimeType.split('/')[0];
-	if (allowedTypes.includes(`${category}/*`)) return true;
+	if (false) return true;
 
 	return false;
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run



 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] ConditionalExpression
src/lib/server/security.ts:116:6
 
 	// Wildcard match (e.g., image/*)
 	const category = mimeType.split('/')[0];
-	if (allowedTypes.includes(`${category}/*`)) return true;
+	if (true) return true;
 
 	return false;
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] StringLiteral
src/lib/server/security.ts:128:3
 	const dangerous = [
 		'.exe',
 		'.bat',
-		'.cmd',
+		"",
 		'.com',
 		'.pif',
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] StringLiteral
src/lib/server/security.ts:129:3
 		'.exe',
 		'.bat',
 		'.cmd',
-		'.com',
+		"",
 		'.pif',
 		'.scr',
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] StringLiteral
src/lib/server/security.ts:131:3
 		'.cmd',
 		'.com',
 		'.pif',
-		'.scr',
+		"",
 		'.vbs',
 		'.js',
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run



 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] StringLiteral
src/lib/server/security.ts:132:3
 		'.com',
 		'.pif',
 		'.scr',
-		'.vbs',
+		"",
 		'.js',
 		'.jse',
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] StringLiteral
src/lib/server/security.ts:133:3
 		'.pif',
 		'.scr',
 		'.vbs',
-		'.js',
+		"",
 		'.jse',
 		'.wsf',
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] StringLiteral
src/lib/server/security.ts:135:3
 		'.vbs',
 		'.js',
 		'.jse',
-		'.wsf',
+		"",
 		'.wsh',
 		'.ps1',
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] StringLiteral
src/lib/server/security.ts:142:3
 		'.sh',
 		'.bash',
 		'.csh',
-		'.jar',
+		"",
 		'.app',
 		'.deb',
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run



 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] ConditionalExpression
src/lib/server/security.ts:148:14
 		'.rpm'
 	];
 
-	const ext = filename.toLowerCase().split('.').pop() || '';
+	const ext = false;
 	return dangerous.includes(`.${ext}`);
 }
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run



 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5

[Killed] LogicalOperator
src/lib/server/security.ts:148:14
 		'.rpm'
 	];
 
-	const ext = filename.toLowerCase().split('.').pop() || '';
+	const ext = filename.toLowerCase().split('.').pop() && '';
 	return dangerous.includes(`.${ext}`);
 }
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run



 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-TDdqE5
