[Survived] BlockStatement
src/lib/server/session.ts:19:22
 	private static readonly COOKIE_NAME = 'privasend_session';
 	private static sessionSecret: string;
 
-	static initialize() {
-		// Auto-generate session secret if not configured
-		this.sessionSecret = config.auth.sessionSecret || randomBytes(32).toString('hex');
-		if (!config.auth.sessionSecret) {
-			console.log('Session secret auto-generated');
-		}
-		console.log('Session service initialized');
-	}
+	static initialize() {}
 
 	static createSession(): Session {

[Killed] LogicalOperator
src/lib/server/session.ts:21:24
 
 	static initialize() {
 		// Auto-generate session secret if not configured
-		this.sessionSecret = config.auth.sessionSecret || randomBytes(32).toString('hex');
+		this.sessionSecret = config.auth.sessionSecret && randomBytes(32).toString('hex');
 		if (!config.auth.sessionSecret) {
 			console.log('Session secret auto-generated');
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/server/session.ts:21:24
 
 	static initialize() {
 		// Auto-generate session secret if not configured
-		this.sessionSecret = config.auth.sessionSecret || randomBytes(32).toString('hex');
+		this.sessionSecret = false;
 		if (!config.auth.sessionSecret) {
 			console.log('Session secret auto-generated');
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/session.ts:22:35
 	static initialize() {
 		// Auto-generate session secret if not configured
 		this.sessionSecret = config.auth.sessionSecret || randomBytes(32).toString('hex');
-		if (!config.auth.sessionSecret) {
-			console.log('Session secret auto-generated');
-		}
+		if (!config.auth.sessionSecret) {}
 		console.log('Session service initialized');
 	}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BooleanLiteral
src/lib/server/session.ts:22:7
 	static initialize() {
 		// Auto-generate session secret if not configured
 		this.sessionSecret = config.auth.sessionSecret || randomBytes(32).toString('hex');
-		if (!config.auth.sessionSecret) {
+		if (config.auth.sessionSecret) {
 			console.log('Session secret auto-generated');
 		}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Survived] StringLiteral
src/lib/server/session.ts:23:16
 		// Auto-generate session secret if not configured
 		this.sessionSecret = config.auth.sessionSecret || randomBytes(32).toString('hex');
 		if (!config.auth.sessionSecret) {
-			console.log('Session secret auto-generated');
+			console.log("");
 		}
 		console.log('Session service initialized');

[Killed] BlockStatement
src/lib/server/session.ts:28:34
 		console.log('Session service initialized');
 	}
 
-	static createSession(): Session {
-		const id = randomBytes(32).toString('hex');
-		const timeoutHours = config.auth.sessionTimeoutHours;
-
-		const session: Session = {
-			id,
-			createdAt: new Date(),
-			expiresAt: new Date(Date.now() + timeoutHours * 60 * 60 * 1000),
-			isAdmin: true
-		};
-
-		sessions.set(id, session);
-		return session;
-	}
+	static createSession(): Session {}
 
 	static getSession(sessionId: string): Session | null {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ArithmeticOperator
src/lib/server/session.ts:35:37
 		const session: Session = {
 			id,
 			createdAt: new Date(),
-			expiresAt: new Date(Date.now() + timeoutHours * 60 * 60 * 1000),
+			expiresAt: new Date(Date.now() + timeoutHours / 60 * 60 * 1000),
 			isAdmin: true
 		};
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ArithmeticOperator
src/lib/server/session.ts:35:24
 		const session: Session = {
 			id,
 			createdAt: new Date(),
-			expiresAt: new Date(Date.now() + timeoutHours * 60 * 60 * 1000),
+			expiresAt: new Date(Date.now() - timeoutHours * 60 * 60 * 1000),
 			isAdmin: true
 		};
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BooleanLiteral
src/lib/server/session.ts:36:13
 			id,
 			createdAt: new Date(),
 			expiresAt: new Date(Date.now() + timeoutHours * 60 * 60 * 1000),
-			isAdmin: true
+			isAdmin: false
 		};
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run



 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/session.ts:43:55
 		return session;
 	}
 
-	static getSession(sessionId: string): Session | null {
-		const session = sessions.get(sessionId);
-		if (!session) return null;
-
-		// Check expiration
-		if (new Date() > session.expiresAt) {
-			this.destroySession(sessionId);
-			return null;
-		}
-
-		return session;
-	}
+	static getSession(sessionId: string): Session | null {}
 
 	static destroySession(sessionId: string): void {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BooleanLiteral
src/lib/server/session.ts:45:7
 
 	static getSession(sessionId: string): Session | null {
 		const session = sessions.get(sessionId);
-		if (!session) return null;
+		if (session) return null;
 
 		// Check expiration
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/server/session.ts:45:7
 
 	static getSession(sessionId: string): Session | null {
 		const session = sessions.get(sessionId);
-		if (!session) return null;
+		if (false) return null;
 
 		// Check expiration
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/server/session.ts:48:7
 		if (!session) return null;
 
 		// Check expiration
-		if (new Date() > session.expiresAt) {
+		if (true) {
 			this.destroySession(sessionId);
 			return null;
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/session.ts:48:39
 		if (!session) return null;
 
 		// Check expiration
-		if (new Date() > session.expiresAt) {
-			this.destroySession(sessionId);
-			return null;
-		}
+		if (new Date() > session.expiresAt) {}
 
 		return session;
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/session.ts:56:49
 		return session;
 	}
 
-	static destroySession(sessionId: string): void {
-		sessions.delete(sessionId);
-	}
+	static destroySession(sessionId: string): void {}
 
 	static setSessionCookie(event: RequestEvent, sessionId: string): void {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/session.ts:60:72
 		sessions.delete(sessionId);
 	}
 
-	static setSessionCookie(event: RequestEvent, sessionId: string): void {
-		event.cookies.set(this.COOKIE_NAME, sessionId, {
-			path: '/',
-			httpOnly: true,
-			secure: process.env.NODE_ENV === 'production',
-			sameSite: 'strict',
-			maxAge: config.auth.sessionTimeoutHours * 60 * 60
-		});
-	}
+	static setSessionCookie(event: RequestEvent, sessionId: string): void {}
 
 	static clearSessionCookie(event: RequestEvent): void {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Survived] BooleanLiteral
src/lib/server/session.ts:63:14
 	static setSessionCookie(event: RequestEvent, sessionId: string): void {
 		event.cookies.set(this.COOKIE_NAME, sessionId, {
 			path: '/',
-			httpOnly: true,
+			httpOnly: false,
 			secure: process.env.NODE_ENV === 'production',
 			sameSite: 'strict',

[Killed] ConditionalExpression
src/lib/server/session.ts:64:12
 		event.cookies.set(this.COOKIE_NAME, sessionId, {
 			path: '/',
 			httpOnly: true,
-			secure: process.env.NODE_ENV === 'production',
+			secure: false,
 			sameSite: 'strict',
 			maxAge: config.auth.sessionTimeoutHours * 60 * 60
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] EqualityOperator
src/lib/server/session.ts:64:12
 		event.cookies.set(this.COOKIE_NAME, sessionId, {
 			path: '/',
 			httpOnly: true,
-			secure: process.env.NODE_ENV === 'production',
+			secure: process.env.NODE_ENV !== 'production',
 			sameSite: 'strict',
 			maxAge: config.auth.sessionTimeoutHours * 60 * 60
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] StringLiteral
src/lib/server/session.ts:65:14
 			path: '/',
 			httpOnly: true,
 			secure: process.env.NODE_ENV === 'production',
-			sameSite: 'strict',
+			sameSite: "",
 			maxAge: config.auth.sessionTimeoutHours * 60 * 60
 		});
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Survived] ArithmeticOperator
src/lib/server/session.ts:66:12
 			httpOnly: true,
 			secure: process.env.NODE_ENV === 'production',
 			sameSite: 'strict',
-			maxAge: config.auth.sessionTimeoutHours * 60 * 60
+			maxAge: config.auth.sessionTimeoutHours / 60 * 60
 		});
 	}

[Survived] ArithmeticOperator
src/lib/server/session.ts:66:12
 			httpOnly: true,
 			secure: process.env.NODE_ENV === 'production',
 			sameSite: 'strict',
-			maxAge: config.auth.sessionTimeoutHours * 60 * 60
+			maxAge: config.auth.sessionTimeoutHours * 60 / 60
 		});
 	}

[Survived] BlockStatement
src/lib/server/session.ts:70:55
 		});
 	}
 
-	static clearSessionCookie(event: RequestEvent): void {
-		event.cookies.delete(this.COOKIE_NAME, { path: '/' });
-	}
+	static clearSessionCookie(event: RequestEvent): void {}
 
 	static getSessionFromCookie(event: RequestEvent): Session | null {

[Killed] StringLiteral
src/lib/server/session.ts:71:50
 	}
 
 	static clearSessionCookie(event: RequestEvent): void {
-		event.cookies.delete(this.COOKIE_NAME, { path: '/' });
+		event.cookies.delete(this.COOKIE_NAME, { path: "" });
 	}
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/session.ts:74:67
 		event.cookies.delete(this.COOKIE_NAME, { path: '/' });
 	}
 
-	static getSessionFromCookie(event: RequestEvent): Session | null {
-		const sessionId = event.cookies.get(this.COOKIE_NAME);
-		if (!sessionId) return null;
-
-		return this.getSession(sessionId);
-	}
+	static getSessionFromCookie(event: RequestEvent): Session | null {}
 
 	// Cleanup expired sessions periodically
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BooleanLiteral
src/lib/server/session.ts:76:7
 
 	static getSessionFromCookie(event: RequestEvent): Session | null {
 		const sessionId = event.cookies.get(this.COOKIE_NAME);
-		if (!sessionId) return null;
+		if (sessionId) return null;
 
 		return this.getSession(sessionId);
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/server/session.ts:76:7
 
 	static getSessionFromCookie(event: RequestEvent): Session | null {
 		const sessionId = event.cookies.get(this.COOKIE_NAME);
-		if (!sessionId) return null;
+		if (true) return null;
 
 		return this.getSession(sessionId);
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Survived] BlockStatement
src/lib/server/session.ts:82:30
 	}
 
 	// Cleanup expired sessions periodically
-	static startCleanup(): void {
-		setInterval(
-			() => {
-				const now = new Date();
-				for (const [id, session] of sessions.entries()) {
-					if (now > session.expiresAt) {
-						sessions.delete(id);
-					}
-				}
-			},
-			60 * 60 * 1000
-		); // Every hour
-	}
+	static startCleanup(): void {}
 
 	// Get session count for monitoring

[Survived] BlockStatement
src/lib/server/session.ts:84:10
 	// Cleanup expired sessions periodically
 	static startCleanup(): void {
 		setInterval(
-			() => {
-				const now = new Date();
-				for (const [id, session] of sessions.entries()) {
-					if (now > session.expiresAt) {
-						sessions.delete(id);
-					}
-				}
-			},
+			() => {},
 			60 * 60 * 1000
 		); // Every hour

[Survived] BlockStatement
src/lib/server/session.ts:86:53
 		setInterval(
 			() => {
 				const now = new Date();
-				for (const [id, session] of sessions.entries()) {
-					if (now > session.expiresAt) {
-						sessions.delete(id);
-					}
-				}
+				for (const [id, session] of sessions.entries()) {}
 			},
 			60 * 60 * 1000

[Killed] ConditionalExpression
src/lib/server/session.ts:87:10
 			() => {
 				const now = new Date();
 				for (const [id, session] of sessions.entries()) {
-					if (now > session.expiresAt) {
+					if (true) {
 						sessions.delete(id);
 					}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] EqualityOperator
src/lib/server/session.ts:87:10
 			() => {
 				const now = new Date();
 				for (const [id, session] of sessions.entries()) {
-					if (now > session.expiresAt) {
+					if (now >= session.expiresAt) {
 						sessions.delete(id);
 					}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ArithmeticOperator
src/lib/server/session.ts:92:4
 					}
 				}
 			},
-			60 * 60 * 1000
+			60 / 60 * 1000
 		); // Every hour
 	}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Survived] ArithmeticOperator
src/lib/server/session.ts:92:4
 					}
 				}
 			},
-			60 * 60 * 1000
+			60 * 60 / 1000
 		); // Every hour
 	}

[Killed] BlockStatement
src/lib/server/session.ts:97:35
 	}
 
 	// Get session count for monitoring
-	static getSessionCount(): number {
-		return sessions.size;
-	}
+	static getSessionCount(): number {}
 }
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL
