[Timeout] StringLiteral
src/lib/stores/theme.ts:7:48
 type Theme = 'light' | 'dark';
 
 function createThemeStore() {
-	const stored = browser ? localStorage.getItem('theme') : null;
+	const stored = browser ? localStorage.getItem("") : null;
 	const initial: Theme = (stored as Theme) || 'light';
 

[Timeout] LogicalOperator
src/lib/stores/theme.ts:8:25
 
 function createThemeStore() {
 	const stored = browser ? localStorage.getItem('theme') : null;
-	const initial: Theme = (stored as Theme) || 'light';
+	const initial: Theme = stored as Theme && 'light';
 
 	const store = writable<Theme>(initial);

[Timeout] ConditionalExpression
src/lib/stores/theme.ts:8:25
 
 function createThemeStore() {
 	const stored = browser ? localStorage.getItem('theme') : null;
-	const initial: Theme = (stored as Theme) || 'light';
+	const initial: Theme = true;
 
 	const store = writable<Theme>(initial);

[Killed] ConditionalExpression
src/lib/stores/theme.ts:14:6
 	let currentTheme = initial;
 
 	// Apply theme on init
-	if (browser && initial) {
+	if (true) {
 		document.documentElement.setAttribute('data-theme', initial);
 	}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/stores/theme.ts:14:6
 	let currentTheme = initial;
 
 	// Apply theme on init
-	if (browser && initial) {
+	if (false) {
 		document.documentElement.setAttribute('data-theme', initial);
 	}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/stores/theme.ts:19:29
 	}
 
 	// Subscribe to update current value
-	store.subscribe((value) => {
-		currentTheme = value;
-	});
+	store.subscribe((value) => {});
 
 	return {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ObjectLiteral
src/lib/stores/theme.ts:23:9
 		currentTheme = value;
 	});
 
-	return {
-		subscribe: store.subscribe,
-		toggle() {
-			const newTheme = currentTheme === 'light' ? 'dark' : 'light';
-			this.set(newTheme);
-		},
-		set(newTheme: Theme) {
-			if (browser) {
-				localStorage.setItem('theme', newTheme);
-				document.documentElement.setAttribute('data-theme', newTheme);
-			}
-			store.set(newTheme);
-		}
-	};
+	return {};
 }
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/stores/theme.ts:25:12
 
 	return {
 		subscribe: store.subscribe,
-		toggle() {
-			const newTheme = currentTheme === 'light' ? 'dark' : 'light';
-			this.set(newTheme);
-		},
+		toggle() {},
 		set(newTheme: Theme) {
 			if (browser) {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] EqualityOperator
src/lib/stores/theme.ts:26:21
 	return {
 		subscribe: store.subscribe,
 		toggle() {
-			const newTheme = currentTheme === 'light' ? 'dark' : 'light';
+			const newTheme = currentTheme !== 'light' ? 'dark' : 'light';
 			this.set(newTheme);
 		},
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/stores/theme.ts:26:21
 	return {
 		subscribe: store.subscribe,
 		toggle() {
-			const newTheme = currentTheme === 'light' ? 'dark' : 'light';
+			const newTheme = true ? 'dark' : 'light';
 			this.set(newTheme);
 		},
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/stores/theme.ts:29:24
 			const newTheme = currentTheme === 'light' ? 'dark' : 'light';
 			this.set(newTheme);
 		},
-		set(newTheme: Theme) {
-			if (browser) {
-				localStorage.setItem('theme', newTheme);
-				document.documentElement.setAttribute('data-theme', newTheme);
-			}
-			store.set(newTheme);
-		}
+		set(newTheme: Theme) {}
 	};
 }
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/stores/theme.ts:30:8
 			this.set(newTheme);
 		},
 		set(newTheme: Theme) {
-			if (browser) {
+			if (false) {
 				localStorage.setItem('theme', newTheme);
 				document.documentElement.setAttribute('data-theme', newTheme);
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/stores/theme.ts:30:8
 			this.set(newTheme);
 		},
 		set(newTheme: Theme) {
-			if (browser) {
+			if (true) {
 				localStorage.setItem('theme', newTheme);
 				document.documentElement.setAttribute('data-theme', newTheme);
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run



 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL
