[Killed] BlockStatement
src/lib/server/audit.ts:19:76
 }
 
 export class AuditService {
-	static log(entry: Omit<AuditLog, 'id' | 'timestamp' | 'createdAt'>): void {
-		const now = Date.now();
-		const auditLog = {
-			...entry,
-			timestamp: now,
-			createdAt: now,
-			details: entry.details ? JSON.stringify(entry.details) : undefined
-		};
-
-		database.createAuditLog(auditLog);
-	}
+	static log(entry: Omit<AuditLog, 'id' | 'timestamp' | 'createdAt'>): void {}
 
 	static logAuth(
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/audit.ts:36:10
 		status: 'success' | 'failure',
 		ipAddress: string,
 		details?: Record<string, unknown>
-	): void {
-		this.log({
-			eventType: 'authentication',
-			userType: 'admin',
-			ipAddress,
-			action,
-			status,
-			resourceType: 'session',
-			details
-		});
-	}
+	): void {}
 
 	static logUpload(
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ObjectLiteral
src/lib/server/audit.ts:37:12
 		ipAddress: string,
 		details?: Record<string, unknown>
 	): void {
-		this.log({
-			eventType: 'authentication',
-			userType: 'admin',
-			ipAddress,
-			action,
-			status,
-			resourceType: 'session',
-			details
-		});
+		this.log({});
 	}
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/audit.ts:55:10
 		ipAddress: string,
 		userAgent?: string,
 		details?: Record<string, unknown>
-	): void {
-		this.log({
-			eventType: 'upload',
-			userType: 'admin',
-			ipAddress,
-			userAgent,
-			resourceType: 'file',
-			resourceId: fileId,
-			action,
-			status,
-			details
-		});
-	}
+	): void {}
 
 	static logLinkCreation(
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ObjectLiteral
src/lib/server/audit.ts:56:12
 		userAgent?: string,
 		details?: Record<string, unknown>
 	): void {
-		this.log({
-			eventType: 'upload',
-			userType: 'admin',
-			ipAddress,
-			userAgent,
-			resourceType: 'file',
-			resourceId: fileId,
-			action,
-			status,
-			details
-		});
+		this.log({});
 	}
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] StringLiteral
src/lib/server/audit.ts:57:15
 		details?: Record<string, unknown>
 	): void {
 		this.log({
-			eventType: 'upload',
+			eventType: "",
 			userType: 'admin',
 			ipAddress,
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] StringLiteral
src/lib/server/audit.ts:61:18
 			userType: 'admin',
 			ipAddress,
 			userAgent,
-			resourceType: 'file',
+			resourceType: "",
 			resourceId: fileId,
 			action,
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/audit.ts:75:10
 		sourceType: 'upload' | 'shared',
 		ipAddress: string,
 		details?: Record<string, unknown>
-	): void {
-		this.log({
-			eventType: 'link_creation',
-			userType: 'admin',
-			ipAddress,
-			resourceType: 'link',
-			resourceId: linkToken,
-			action: 'create',
-			status,
-			details: { ...details, sourceType }
-		});
-	}
+	): void {}
 
 	static logDownload(
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/audit.ts:95:10
 		ipAddress: string,
 		userAgent?: string,
 		details?: Record<string, unknown>
-	): void {
-		this.log({
-			eventType: 'download',
-			userType: 'public',
-			ipAddress,
-			userAgent,
-			resourceType: 'link',
-			resourceId: linkToken,
-			action,
-			status,
-			details
-		});
-	}
+	): void {}
 
 	static logBrowse(ipAddress: string, path: string, userAgent?: string): void {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ObjectLiteral
src/lib/server/audit.ts:96:12
 		userAgent?: string,
 		details?: Record<string, unknown>
 	): void {
-		this.log({
-			eventType: 'download',
-			userType: 'public',
-			ipAddress,
-			userAgent,
-			resourceType: 'link',
-			resourceId: linkToken,
-			action,
-			status,
-			details
-		});
+		this.log({});
 	}
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/audit.ts:109:78
 		});
 	}
 
-	static logBrowse(ipAddress: string, path: string, userAgent?: string): void {
-		this.log({
-			eventType: 'browse',
-			userType: 'admin',
-			ipAddress,
-			userAgent,
-			action: 'read',
-			status: 'success',
-			details: { path }
-		});
-	}
+	static logBrowse(ipAddress: string, path: string, userAgent?: string): void {}
 
 	static getRecentLogs(limit: number = 100): unknown[] {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] StringLiteral
src/lib/server/audit.ts:115:12
 			userType: 'admin',
 			ipAddress,
 			userAgent,
-			action: 'read',
+			action: "",
 			status: 'success',
 			details: { path }
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] StringLiteral
src/lib/server/audit.ts:116:12
 			ipAddress,
 			userAgent,
 			action: 'read',
-			status: 'success',
+			status: "",
 			details: { path }
 		});
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/audit.ts:121:55
 		});
 	}
 
-	static getRecentLogs(limit: number = 100): unknown[] {
-		return database.getRecentAuditLogs(limit);
-	}
+	static getRecentLogs(limit: number = 100): unknown[] {}
 
 	static getLogsByEventType(eventType: string, limit: number = 100): unknown[] {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/audit.ts:125:79
 		return database.getRecentAuditLogs(limit);
 	}
 
-	static getLogsByEventType(eventType: string, limit: number = 100): unknown[] {
-		return database.getAuditLogsByEventType(eventType, limit);
-	}
+	static getLogsByEventType(eventType: string, limit: number = 100): unknown[] {}
 
 	static getLogsByIp(ipAddress: string, limit: number = 100): unknown[] {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/audit.ts:129:72
 		return database.getAuditLogsByEventType(eventType, limit);
 	}
 
-	static getLogsByIp(ipAddress: string, limit: number = 100): unknown[] {
-		return database.getAuditLogsByIp(ipAddress, limit);
-	}
+	static getLogsByIp(ipAddress: string, limit: number = 100): unknown[] {}
 
 	static getLogsByResource(resourceType: string, resourceId: string): unknown[] {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/audit.ts:133:80
 		return database.getAuditLogsByIp(ipAddress, limit);
 	}
 
-	static getLogsByResource(resourceType: string, resourceId: string): unknown[] {
-		return database.getAuditLogsByResource(resourceType, resourceId);
-	}
+	static getLogsByResource(resourceType: string, resourceId: string): unknown[] {}
 
 	static cleanupOldLogs(retentionDays: number): number {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/audit.ts:137:55
 		return database.getAuditLogsByResource(resourceType, resourceId);
 	}
 
-	static cleanupOldLogs(retentionDays: number): number {
-		return database.cleanupOldAuditLogs(retentionDays);
-	}
+	static cleanupOldLogs(retentionDays: number): number {}
 }
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL
