[Killed] BooleanLiteral
src/lib/server/auth.ts:6:31
 
 export class AuthService {
 	private static passwordHash: string | null = null;
-	private static initialized = false;
+	private static initialized = true;
 
 	static async initialize(): Promise<void> {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/auth.ts:8:43
 	private static passwordHash: string | null = null;
 	private static initialized = false;
 
-	static async initialize(): Promise<void> {
-		if (this.initialized) return;
-
-		if (!config.auth.enabled) {
-			console.log('Authentication disabled');
-			this.initialized = true;
-			return;
-		}
-
-		if (!config.auth.adminPassword) {
-			throw new Error('ADMIN_PASSWORD must be set when AUTH_ENABLED=true');
-		}
-
-		// Hash password at startup
-		console.log('Hashing admin password...');
-		this.passwordHash = await bcrypt.hash(config.auth.adminPassword, 10);
-		console.log('Authentication enabled - Admin password configured');
-		this.initialized = true;
-	}
+	static async initialize(): Promise<void> {}
 
 	static async verifyPassword(password: string): Promise<boolean> {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/server/auth.ts:9:7
 	private static initialized = false;
 
 	static async initialize(): Promise<void> {
-		if (this.initialized) return;
+		if (true) return;
 
 		if (!config.auth.enabled) {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/server/auth.ts:9:7
 	private static initialized = false;
 
 	static async initialize(): Promise<void> {
-		if (this.initialized) return;
+		if (false) return;
 
 		if (!config.auth.enabled) {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/server/auth.ts:11:7
 	static async initialize(): Promise<void> {
 		if (this.initialized) return;
 
-		if (!config.auth.enabled) {
+		if (true) {
 			console.log('Authentication disabled');
 			this.initialized = true;
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BooleanLiteral
src/lib/server/auth.ts:11:7
 	static async initialize(): Promise<void> {
 		if (this.initialized) return;
 
-		if (!config.auth.enabled) {
+		if (config.auth.enabled) {
 			console.log('Authentication disabled');
 			this.initialized = true;
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] StringLiteral
src/lib/server/auth.ts:12:16
 		if (this.initialized) return;
 
 		if (!config.auth.enabled) {
-			console.log('Authentication disabled');
+			console.log("");
 			this.initialized = true;
 			return;
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BooleanLiteral
src/lib/server/auth.ts:13:23
 
 		if (!config.auth.enabled) {
 			console.log('Authentication disabled');
-			this.initialized = true;
+			this.initialized = false;
 			return;
 		}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BooleanLiteral
src/lib/server/auth.ts:17:7
 			return;
 		}
 
-		if (!config.auth.adminPassword) {
+		if (config.auth.adminPassword) {
 			throw new Error('ADMIN_PASSWORD must be set when AUTH_ENABLED=true');
 		}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/auth.ts:17:35
 			return;
 		}
 
-		if (!config.auth.adminPassword) {
-			throw new Error('ADMIN_PASSWORD must be set when AUTH_ENABLED=true');
-		}
+		if (!config.auth.adminPassword) {}
 
 		// Hash password at startup
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] StringLiteral
src/lib/server/auth.ts:22:15
 		}
 
 		// Hash password at startup
-		console.log('Hashing admin password...');
+		console.log("");
 		this.passwordHash = await bcrypt.hash(config.auth.adminPassword, 10);
 		console.log('Authentication enabled - Admin password configured');
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BooleanLiteral
src/lib/server/auth.ts:25:22
 		console.log('Hashing admin password...');
 		this.passwordHash = await bcrypt.hash(config.auth.adminPassword, 10);
 		console.log('Authentication enabled - Admin password configured');
-		this.initialized = true;
+		this.initialized = false;
 	}
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/auth.ts:28:66
 		this.initialized = true;
 	}
 
-	static async verifyPassword(password: string): Promise<boolean> {
-		if (!this.initialized) {
-			await this.initialize();
-		}
-
-		if (!this.passwordHash) {
-			throw new Error('Authentication not initialized');
-		}
-
-		return bcrypt.compare(password, this.passwordHash);
-	}
+	static async verifyPassword(password: string): Promise<boolean> {}
 
 	static isEnabled(): boolean {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run



 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/server/auth.ts:29:7
 	}
 
 	static async verifyPassword(password: string): Promise<boolean> {
-		if (!this.initialized) {
+		if (false) {
 			await this.initialize();
 		}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/auth.ts:29:26
 	}
 
 	static async verifyPassword(password: string): Promise<boolean> {
-		if (!this.initialized) {
-			await this.initialize();
-		}
+		if (!this.initialized) {}
 
 		if (!this.passwordHash) {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/auth.ts:33:27
 			await this.initialize();
 		}
 
-		if (!this.passwordHash) {
-			throw new Error('Authentication not initialized');
-		}
+		if (!this.passwordHash) {}
 
 		return bcrypt.compare(password, this.passwordHash);
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] ConditionalExpression
src/lib/server/auth.ts:33:7
 			await this.initialize();
 		}
 
-		if (!this.passwordHash) {
+		if (false) {
 			throw new Error('Authentication not initialized');
 		}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run



 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] StringLiteral
src/lib/server/auth.ts:34:20
 		}
 
 		if (!this.passwordHash) {
-			throw new Error('Authentication not initialized');
+			throw new Error("");
 		}
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/server/auth.ts:40:30
 		return bcrypt.compare(password, this.passwordHash);
 	}
 
-	static isEnabled(): boolean {
-		return config.auth.enabled;
-	}
+	static isEnabled(): boolean {}
 }
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL
