[Killed] ObjectLiteral
src/lib/stores/auth.ts:11:57
 }
 
 function createAuthStore() {
-	const { subscribe, set, update } = writable<AuthState>({
-		isAuthenticated: false,
-		authEnabled: false,
-		loading: true
-	});
+	const { subscribe, set, update } = writable<AuthState>({});
 
 	return {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BooleanLiteral
src/lib/stores/auth.ts:12:20
 
 function createAuthStore() {
 	const { subscribe, set, update } = writable<AuthState>({
-		isAuthenticated: false,
+		isAuthenticated: true,
 		authEnabled: false,
 		loading: true
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BooleanLiteral
src/lib/stores/auth.ts:13:16
 function createAuthStore() {
 	const { subscribe, set, update } = writable<AuthState>({
 		isAuthenticated: false,
-		authEnabled: false,
+		authEnabled: true,
 		loading: true
 	});
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BooleanLiteral
src/lib/stores/auth.ts:14:12
 	const { subscribe, set, update } = writable<AuthState>({
 		isAuthenticated: false,
 		authEnabled: false,
-		loading: true
+		loading: false
 	});
 
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Survived] BlockStatement
src/lib/stores/auth.ts:19:23
 
 	return {
 		subscribe,
-		async checkStatus() {
-			try {
-				const response = await fetch('/api/auth/status');
-				const data = await response.json();
-
-				update((state) => ({
-					...state,
-					isAuthenticated: data.authenticated,
-					authEnabled: data.authEnabled,
-					loading: false
-				}));
-			} catch (err) {
-				console.error('Failed to check auth status:', err);
-				update((state) => ({ ...state, loading: false }));
-			}
-		},
+		async checkStatus() {},
 		async logout() {
 			try {

[Survived] BlockStatement
src/lib/stores/auth.ts:20:8
 	return {
 		subscribe,
 		async checkStatus() {
-			try {
-				const response = await fetch('/api/auth/status');
-				const data = await response.json();
-
-				update((state) => ({
-					...state,
-					isAuthenticated: data.authenticated,
-					authEnabled: data.authEnabled,
-					loading: false
-				}));
-			} catch (err) {
+			try {} catch (err) {
 				console.error('Failed to check auth status:', err);
 				update((state) => ({ ...state, loading: false }));

[Killed] ArrowFunction
src/lib/stores/auth.ts:24:12
 				const response = await fetch('/api/auth/status');
 				const data = await response.json();
 
-				update((state) => ({
-					...state,
-					isAuthenticated: data.authenticated,
-					authEnabled: data.authEnabled,
-					loading: false
-				}));
+				update(() => undefined);
 			} catch (err) {
 				console.error('Failed to check auth status:', err);
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BooleanLiteral
src/lib/stores/auth.ts:28:15
 					...state,
 					isAuthenticated: data.authenticated,
 					authEnabled: data.authEnabled,
-					loading: false
+					loading: true
 				}));
 			} catch (err) {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Killed] BlockStatement
src/lib/stores/auth.ts:30:18
 					authEnabled: data.authEnabled,
 					loading: false
 				}));
-			} catch (err) {
-				console.error('Failed to check auth status:', err);
-				update((state) => ({ ...state, loading: false }));
-			}
+			} catch (err) {}
 		},
 		async logout() {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Survived] StringLiteral
src/lib/stores/auth.ts:31:19
 					loading: false
 				}));
 			} catch (err) {
-				console.error('Failed to check auth status:', err);
+				console.error("", err);
 				update((state) => ({ ...state, loading: false }));
 			}

[Killed] ArrowFunction
src/lib/stores/auth.ts:32:12
 				}));
 			} catch (err) {
 				console.error('Failed to check auth status:', err);
-				update((state) => ({ ...state, loading: false }));
+				update(() => undefined);
 			}
 		},
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Survived] BooleanLiteral
src/lib/stores/auth.ts:32:45
 				}));
 			} catch (err) {
 				console.error('Failed to check auth status:', err);
-				update((state) => ({ ...state, loading: false }));
+				update((state) => ({ ...state, loading: true }));
 			}
 		},

[Survived] BlockStatement
src/lib/stores/auth.ts:35:18
 				update((state) => ({ ...state, loading: false }));
 			}
 		},
-		async logout() {
-			try {
-				await fetch('/api/auth/logout', { method: 'POST' });
-				set({ isAuthenticated: false, authEnabled: true, loading: false });
-				goto('/login');
-			} catch (err) {
-				console.error('Logout failed:', err);
-			}
-		}
+		async logout() {}
 	};
 }

[Killed] BlockStatement
src/lib/stores/auth.ts:36:8
 			}
 		},
 		async logout() {
-			try {
-				await fetch('/api/auth/logout', { method: 'POST' });
-				set({ isAuthenticated: false, authEnabled: true, loading: false });
-				goto('/login');
-			} catch (err) {
+			try {} catch (err) {
 				console.error('Logout failed:', err);
 			}
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Survived] ObjectLiteral
src/lib/stores/auth.ts:37:37
 		},
 		async logout() {
 			try {
-				await fetch('/api/auth/logout', { method: 'POST' });
+				await fetch('/api/auth/logout', {});
 				set({ isAuthenticated: false, authEnabled: true, loading: false });
 				goto('/login');

[Survived] StringLiteral
src/lib/stores/auth.ts:37:17
 		},
 		async logout() {
 			try {
-				await fetch('/api/auth/logout', { method: 'POST' });
+				await fetch("", { method: 'POST' });
 				set({ isAuthenticated: false, authEnabled: true, loading: false });
 				goto('/login');

[Killed] BooleanLiteral
src/lib/stores/auth.ts:38:48
 		async logout() {
 			try {
 				await fetch('/api/auth/logout', { method: 'POST' });
-				set({ isAuthenticated: false, authEnabled: true, loading: false });
+				set({ isAuthenticated: false, authEnabled: false, loading: false });
 				goto('/login');
 			} catch (err) {
killedBy: All tests
statusReason: > privasend@0.4.5 test
> vitest --run




 RUN  v2.1.9 /Users/fred/Code/PrivaSend/.stryker-tmp/sandbox-CtEGkL

[Survived] BooleanLiteral
src/lib/stores/auth.ts:38:28
 		async logout() {
 			try {
 				await fetch('/api/auth/logout', { method: 'POST' });
-				set({ isAuthenticated: false, authEnabled: true, loading: false });
+				set({ isAuthenticated: true, authEnabled: true, loading: false });
 				goto('/login');
 			} catch (err) {

[Timeout] BlockStatement
src/lib/stores/auth.ts:40:18
 				await fetch('/api/auth/logout', { method: 'POST' });
 				set({ isAuthenticated: false, authEnabled: true, loading: false });
 				goto('/login');
-			} catch (err) {
-				console.error('Logout failed:', err);
-			}
+			} catch (err) {}
 		}
 	};
